renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_sci_iic_rx/src/r_sci_iic_rx_private.h
    #if ((('0') <= R_SCI_IIC_CFG_SCI2_SSDA2_PORT) && (('9') >= R_SCI_IIC_CFG_SCI2_SSDA2_PORT))
        #define SCI_IIC_CFG_CH2_SSDA_GP (R_SCI_IIC_CFG_SCI2_SSDA2_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI2_SSDA2_PORT) && (('H') >= R_SCI_IIC_CFG_SCI2_SSDA2_PORT))
        #define SCI_IIC_CFG_CH2_SSDA_GP (R_SCI_IIC_CFG_SCI2_SSDA2_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI2_SSDA2_PORT) && (('N') >= R_SCI_IIC_CFG_SCI2_SSDA2_PORT))
        #define SCI_IIC_CFG_CH2_SSDA_GP (R_SCI_IIC_CFG_SCI2_SSDA2_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI2_SSDA2_PORT)
        #define SCI_IIC_CFG_CH2_SSDA_GP (R_SCI_IIC_CFG_SCI2_SSDA2_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI2_SSDA2_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI2_SSDA2_BIT) && (('7') >= R_SCI_IIC_CFG_SCI2_SSDA2_BIT))
        #define SCI_IIC_CFG_CH2_SSDA_PIN    (R_SCI_IIC_CFG_SCI2_SSDA2_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI2_SSDA2_BIT in r_sci_iic_rx_pin_config.h"
    #endif

/* SCI3 */
    #if ((('0') <= R_SCI_IIC_CFG_SCI3_SSCL3_PORT) && (('9') >= R_SCI_IIC_CFG_SCI3_SSCL3_PORT))
        #define SCI_IIC_CFG_CH3_SSCL_GP (R_SCI_IIC_CFG_SCI3_SSCL3_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI3_SSCL3_PORT) && (('H') >= R_SCI_IIC_CFG_SCI3_SSCL3_PORT))
        #define SCI_IIC_CFG_CH3_SSCL_GP (R_SCI_IIC_CFG_SCI3_SSCL3_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI3_SSCL3_PORT) && (('N') >= R_SCI_IIC_CFG_SCI3_SSCL3_PORT))
        #define SCI_IIC_CFG_CH3_SSCL_GP (R_SCI_IIC_CFG_SCI3_SSCL3_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI3_SSCL3_PORT)
        #define SCI_IIC_CFG_CH3_SSCL_GP (R_SCI_IIC_CFG_SCI3_SSCL3_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI3_SSCL3_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI3_SSCL3_BIT) && (('7') >= R_SCI_IIC_CFG_SCI3_SSCL3_BIT))
        #define SCI_IIC_CFG_CH3_SSCL_PIN    (R_SCI_IIC_CFG_SCI3_SSCL3_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI3_SSCL3_BIT in r_sci_iic_rx_pin_config.h"
    #endif

    #if ((('0') <= R_SCI_IIC_CFG_SCI3_SSDA3_PORT) && (('9') >= R_SCI_IIC_CFG_SCI3_SSDA3_PORT))
        #define SCI_IIC_CFG_CH3_SSDA_GP (R_SCI_IIC_CFG_SCI3_SSDA3_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI3_SSDA3_PORT) && (('H') >= R_SCI_IIC_CFG_SCI3_SSDA3_PORT))
        #define SCI_IIC_CFG_CH3_SSDA_GP (R_SCI_IIC_CFG_SCI3_SSDA3_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI3_SSDA3_PORT) && (('N') >= R_SCI_IIC_CFG_SCI3_SSDA3_PORT))
        #define SCI_IIC_CFG_CH3_SSDA_GP (R_SCI_IIC_CFG_SCI3_SSDA3_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI3_SSDA3_PORT)
        #define SCI_IIC_CFG_CH3_SSDA_GP (R_SCI_IIC_CFG_SCI3_SSDA3_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI3_SSDA3_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI3_SSDA3_BIT) && (('7') >= R_SCI_IIC_CFG_SCI3_SSDA3_BIT))
        #define SCI_IIC_CFG_CH3_SSDA_PIN    (R_SCI_IIC_CFG_SCI3_SSDA3_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI3_SSDA3_BIT in r_sci_iic_rx_pin_config.h"
    #endif

/* SCI4 */
    #if ((('0') <= R_SCI_IIC_CFG_SCI4_SSCL4_PORT) && (('9') >= R_SCI_IIC_CFG_SCI4_SSCL4_PORT))
        #define SCI_IIC_CFG_CH4_SSCL_GP (R_SCI_IIC_CFG_SCI4_SSCL4_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI4_SSCL4_PORT) && (('H') >= R_SCI_IIC_CFG_SCI4_SSCL4_PORT))
        #define SCI_IIC_CFG_CH4_SSCL_GP (R_SCI_IIC_CFG_SCI4_SSCL4_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI4_SSCL4_PORT) && (('N') >= R_SCI_IIC_CFG_SCI4_SSCL4_PORT))
        #define SCI_IIC_CFG_CH4_SSCL_GP (R_SCI_IIC_CFG_SCI4_SSCL4_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI4_SSCL4_PORT)
        #define SCI_IIC_CFG_CH4_SSCL_GP (R_SCI_IIC_CFG_SCI4_SSCL4_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI4_SSCL4_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI4_SSCL4_BIT) && (('7') >= R_SCI_IIC_CFG_SCI4_SSCL4_BIT))
        #define SCI_IIC_CFG_CH4_SSCL_PIN    (R_SCI_IIC_CFG_SCI4_SSCL4_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI4_SSCL4_BIT in r_sci_iic_rx_pin_config.h"
    #endif

    #if ((('0') <= R_SCI_IIC_CFG_SCI4_SSDA4_PORT) && (('9') >= R_SCI_IIC_CFG_SCI4_SSDA4_PORT))
        #define SCI_IIC_CFG_CH4_SSDA_GP (R_SCI_IIC_CFG_SCI4_SSDA4_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI4_SSDA4_PORT) && (('H') >= R_SCI_IIC_CFG_SCI4_SSDA4_PORT))
        #define SCI_IIC_CFG_CH4_SSDA_GP (R_SCI_IIC_CFG_SCI4_SSDA4_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI4_SSDA4_PORT) && (('N') >= R_SCI_IIC_CFG_SCI4_SSDA4_PORT))
        #define SCI_IIC_CFG_CH4_SSDA_GP (R_SCI_IIC_CFG_SCI4_SSDA4_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI4_SSDA4_PORT)
        #define SCI_IIC_CFG_CH4_SSDA_GP (R_SCI_IIC_CFG_SCI4_SSDA4_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI4_SSDA4_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI4_SSDA4_BIT) && (('7') >= R_SCI_IIC_CFG_SCI4_SSDA4_BIT))
        #define SCI_IIC_CFG_CH4_SSDA_PIN    (R_SCI_IIC_CFG_SCI4_SSDA4_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI4_SSDA4_BIT in r_sci_iic_rx_pin_config.h"
    #endif

/* SCI5 */
    #if ((('0') <= R_SCI_IIC_CFG_SCI5_SSCL5_PORT) && (('9') >= R_SCI_IIC_CFG_SCI5_SSCL5_PORT))
        #define SCI_IIC_CFG_CH5_SSCL_GP (R_SCI_IIC_CFG_SCI5_SSCL5_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI5_SSCL5_PORT) && (('H') >= R_SCI_IIC_CFG_SCI5_SSCL5_PORT))
        #define SCI_IIC_CFG_CH5_SSCL_GP (R_SCI_IIC_CFG_SCI5_SSCL5_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI5_SSCL5_PORT) && (('N') >= R_SCI_IIC_CFG_SCI5_SSCL5_PORT))
        #define SCI_IIC_CFG_CH5_SSCL_GP (R_SCI_IIC_CFG_SCI5_SSCL5_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI5_SSCL5_PORT)
        #define SCI_IIC_CFG_CH5_SSCL_GP (R_SCI_IIC_CFG_SCI5_SSCL5_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI5_SSCL5_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI5_SSCL5_BIT) && (('7') >= R_SCI_IIC_CFG_SCI5_SSCL5_BIT))
        #define SCI_IIC_CFG_CH5_SSCL_PIN    (R_SCI_IIC_CFG_SCI5_SSCL5_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI5_SSCL5_BIT in r_sci_iic_rx_pin_config.h"
    #endif

    #if ((('0') <= R_SCI_IIC_CFG_SCI5_SSDA5_PORT) && (('9') >= R_SCI_IIC_CFG_SCI5_SSDA5_PORT))
        #define SCI_IIC_CFG_CH5_SSDA_GP (R_SCI_IIC_CFG_SCI5_SSDA5_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI5_SSDA5_PORT) && (('H') >= R_SCI_IIC_CFG_SCI5_SSDA5_PORT))
        #define SCI_IIC_CFG_CH5_SSDA_GP (R_SCI_IIC_CFG_SCI5_SSDA5_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI5_SSDA5_PORT) && (('N') >= R_SCI_IIC_CFG_SCI5_SSDA5_PORT))
        #define SCI_IIC_CFG_CH5_SSDA_GP (R_SCI_IIC_CFG_SCI5_SSDA5_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI5_SSDA5_PORT)
        #define SCI_IIC_CFG_CH5_SSDA_GP (R_SCI_IIC_CFG_SCI5_SSDA5_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI5_SSDA5_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI5_SSDA5_BIT) && (('7') >= R_SCI_IIC_CFG_SCI5_SSDA5_BIT))
        #define SCI_IIC_CFG_CH5_SSDA_PIN    (R_SCI_IIC_CFG_SCI5_SSDA5_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI5_SSDA5_BIT in r_sci_iic_rx_pin_config.h"
    #endif

