renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_sci_iic_rx/src/r_sci_iic_rx_private.h
    #if ((('0') <= R_SCI_IIC_CFG_SCI9_SSDA9_PORT) && (('9') >= R_SCI_IIC_CFG_SCI9_SSDA9_PORT))
        #define SCI_IIC_CFG_CH9_SSDA_GP (R_SCI_IIC_CFG_SCI9_SSDA9_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI9_SSDA9_PORT) && (('H') >= R_SCI_IIC_CFG_SCI9_SSDA9_PORT))
        #define SCI_IIC_CFG_CH9_SSDA_GP (R_SCI_IIC_CFG_SCI9_SSDA9_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI9_SSDA9_PORT) && (('N') >= R_SCI_IIC_CFG_SCI9_SSDA9_PORT))
        #define SCI_IIC_CFG_CH9_SSDA_GP (R_SCI_IIC_CFG_SCI9_SSDA9_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI9_SSDA9_PORT)
        #define SCI_IIC_CFG_CH9_SSDA_GP (R_SCI_IIC_CFG_SCI9_SSDA9_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI9_SSDA9_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI9_SSDA9_BIT) && (('7') >= R_SCI_IIC_CFG_SCI9_SSDA9_BIT))
        #define SCI_IIC_CFG_CH9_SSDA_PIN    (R_SCI_IIC_CFG_SCI9_SSDA9_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI9_SSDA9_BIT in r_sci_iic_rx_pin_config.h"
    #endif

/* SCI10 */
    #if ((('0') <= R_SCI_IIC_CFG_SCI10_SSCL10_PORT) && (('9') >= R_SCI_IIC_CFG_SCI10_SSCL10_PORT))
        #define SCI_IIC_CFG_CH10_SSCL_GP (R_SCI_IIC_CFG_SCI10_SSCL10_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI10_SSCL10_PORT) && (('H') >= R_SCI_IIC_CFG_SCI10_SSCL10_PORT))
        #define SCI_IIC_CFG_CH10_SSCL_GP (R_SCI_IIC_CFG_SCI10_SSCL10_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI10_SSCL10_PORT) && (('N') >= R_SCI_IIC_CFG_SCI10_SSCL10_PORT))
        #define SCI_IIC_CFG_CH10_SSCL_GP (R_SCI_IIC_CFG_SCI10_SSCL10_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI10_SSCL10_PORT)
        #define SCI_IIC_CFG_CH10_SSCL_GP (R_SCI_IIC_CFG_SCI10_SSCL10_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI10_SSCL10_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI10_SSCL10_BIT) && (('7') >= R_SCI_IIC_CFG_SCI10_SSCL10_BIT))
        #define SCI_IIC_CFG_CH10_SSCL_PIN    (R_SCI_IIC_CFG_SCI10_SSCL10_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI10_SSCL10_BIT in r_sci_iic_rx_pin_config.h"
    #endif

    #if ((('0') <= R_SCI_IIC_CFG_SCI10_SSDA10_PORT) && (('9') >= R_SCI_IIC_CFG_SCI10_SSDA10_PORT))
        #define SCI_IIC_CFG_CH10_SSDA_GP (R_SCI_IIC_CFG_SCI10_SSDA10_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI10_SSDA10_PORT) && (('H') >= R_SCI_IIC_CFG_SCI10_SSDA10_PORT))
        #define SCI_IIC_CFG_CH10_SSDA_GP (R_SCI_IIC_CFG_SCI10_SSDA10_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI10_SSDA10_PORT) && (('N') >= R_SCI_IIC_CFG_SCI10_SSDA10_PORT))
        #define SCI_IIC_CFG_CH10_SSDA_GP (R_SCI_IIC_CFG_SCI10_SSDA10_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI10_SSDA10_PORT)
        #define SCI_IIC_CFG_CH10_SSDA_GP (R_SCI_IIC_CFG_SCI10_SSDA10_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI10_SSDA10_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI10_SSDA10_BIT) && (('7') >= R_SCI_IIC_CFG_SCI10_SSDA10_BIT))
        #define SCI_IIC_CFG_CH10_SSDA_PIN    (R_SCI_IIC_CFG_SCI10_SSDA10_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI10_SSDA10_BIT in r_sci_iic_rx_pin_config.h"
    #endif

/* SCI11 */
    #if ((('0') <= R_SCI_IIC_CFG_SCI11_SSCL11_PORT) && (('9') >= R_SCI_IIC_CFG_SCI11_SSCL11_PORT))
        #define SCI_IIC_CFG_CH11_SSCL_GP (R_SCI_IIC_CFG_SCI11_SSCL11_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI11_SSCL11_PORT) && (('H') >= R_SCI_IIC_CFG_SCI11_SSCL11_PORT))
        #define SCI_IIC_CFG_CH11_SSCL_GP (R_SCI_IIC_CFG_SCI11_SSCL11_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI11_SSCL11_PORT) && (('N') >= R_SCI_IIC_CFG_SCI11_SSCL11_PORT))
        #define SCI_IIC_CFG_CH11_SSCL_GP (R_SCI_IIC_CFG_SCI11_SSCL11_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI11_SSCL11_PORT)
        #define SCI_IIC_CFG_CH11_SSCL_GP (R_SCI_IIC_CFG_SCI11_SSCL11_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI11_SSCL11_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI11_SSCL11_BIT) && (('7') >= R_SCI_IIC_CFG_SCI11_SSCL11_BIT))
        #define SCI_IIC_CFG_CH11_SSCL_PIN    (R_SCI_IIC_CFG_SCI11_SSCL11_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI11_SSCL11_BIT in r_sci_iic_rx_pin_config.h"
    #endif

    #if ((('0') <= R_SCI_IIC_CFG_SCI11_SSDA11_PORT) && (('9') >= R_SCI_IIC_CFG_SCI11_SSDA11_PORT))
        #define SCI_IIC_CFG_CH11_SSDA_GP (R_SCI_IIC_CFG_SCI11_SSDA11_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI11_SSDA11_PORT) && (('H') >= R_SCI_IIC_CFG_SCI11_SSDA11_PORT))
        #define SCI_IIC_CFG_CH11_SSDA_GP (R_SCI_IIC_CFG_SCI11_SSDA11_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI11_SSDA11_PORT) && (('N') >= R_SCI_IIC_CFG_SCI11_SSDA11_PORT))
        #define SCI_IIC_CFG_CH11_SSDA_GP (R_SCI_IIC_CFG_SCI11_SSDA11_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI11_SSDA11_PORT)
        #define SCI_IIC_CFG_CH11_SSDA_GP (R_SCI_IIC_CFG_SCI11_SSDA11_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI11_SSDA11_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI11_SSDA11_BIT) && (('7') >= R_SCI_IIC_CFG_SCI11_SSDA11_BIT))
        #define SCI_IIC_CFG_CH11_SSDA_PIN    (R_SCI_IIC_CFG_SCI11_SSDA11_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI11_SSDA11_BIT in r_sci_iic_rx_pin_config.h"
    #endif

/* SCI12 */
    #if ((('0') <= R_SCI_IIC_CFG_SCI12_SSCL12_PORT) && (('9') >= R_SCI_IIC_CFG_SCI12_SSCL12_PORT))
        #define SCI_IIC_CFG_CH12_SSCL_GP (R_SCI_IIC_CFG_SCI12_SSCL12_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI12_SSCL12_PORT) && (('H') >= R_SCI_IIC_CFG_SCI12_SSCL12_PORT))
        #define SCI_IIC_CFG_CH12_SSCL_GP (R_SCI_IIC_CFG_SCI12_SSCL12_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI12_SSCL12_PORT) && (('N') >= R_SCI_IIC_CFG_SCI12_SSCL12_PORT))
        #define SCI_IIC_CFG_CH12_SSCL_GP (R_SCI_IIC_CFG_SCI12_SSCL12_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI12_SSCL12_PORT)
        #define SCI_IIC_CFG_CH12_SSCL_GP (R_SCI_IIC_CFG_SCI12_SSCL12_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI12_SSCL12_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI12_SSCL12_BIT) && (('7') >= R_SCI_IIC_CFG_SCI12_SSCL12_BIT))
        #define SCI_IIC_CFG_CH12_SSCL_PIN    (R_SCI_IIC_CFG_SCI12_SSCL12_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI12_SSCL12_BIT in r_sci_iic_rx_pin_config.h"
    #endif

    #if ((('0') <= R_SCI_IIC_CFG_SCI12_SSDA12_PORT) && (('9') >= R_SCI_IIC_CFG_SCI12_SSDA12_PORT))
        #define SCI_IIC_CFG_CH12_SSDA_GP (R_SCI_IIC_CFG_SCI12_SSDA12_PORT - 0x30)
    #elif ((('A') <= R_SCI_IIC_CFG_SCI12_SSDA12_PORT) && (('H') >= R_SCI_IIC_CFG_SCI12_SSDA12_PORT))
        #define SCI_IIC_CFG_CH12_SSDA_GP (R_SCI_IIC_CFG_SCI12_SSDA12_PORT - 0x37)
    #elif ((('J') <= R_SCI_IIC_CFG_SCI12_SSDA12_PORT) && (('N') >= R_SCI_IIC_CFG_SCI12_SSDA12_PORT))
        #define SCI_IIC_CFG_CH12_SSDA_GP (R_SCI_IIC_CFG_SCI12_SSDA12_PORT - 0x38)
    #elif (('Q') == R_SCI_IIC_CFG_SCI12_SSDA12_PORT)
        #define SCI_IIC_CFG_CH12_SSDA_GP (R_SCI_IIC_CFG_SCI12_SSDA12_PORT - 0x3A)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI12_SSDA12_PORT in r_sci_iic_rx_pin_config.h"
    #endif
    #if ((('0') <= R_SCI_IIC_CFG_SCI12_SSDA12_BIT) && (('7') >= R_SCI_IIC_CFG_SCI12_SSDA12_BIT))
        #define SCI_IIC_CFG_CH12_SSDA_PIN    (R_SCI_IIC_CFG_SCI12_SSDA12_BIT - 0x30)
    #else
        #error "Error! Invalid setting for R_SCI_IIC_CFG_SCI12_SSDA12_BIT in r_sci_iic_rx_pin_config.h"
    #endif

