renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_sci_iic_rx/src/r_sci_iic_rx_private.h
/* check of channel 6 */
    #if (1 == SCI_IIC_CFG_CH6_INCLUDED)
        #if ((0 >= SCI_IIC_CFG_CH6_BITRATE_BPS) || (384000 < SCI_IIC_CFG_CH6_BITRATE_BPS))
            #error "ERROR - SCI_IIC_CFG_CH6_BITRATE_BPS - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH6_INT_PRIORITY) || ( 15 < SCI_IIC_CFG_CH6_INT_PRIORITY))
            #error "ERROR - SCI_IIC_CFG_CH6_INT_PRIORITY - Parameter error in configures file.  "
        #endif
        #if ((0 > SCI_IIC_CFG_CH6_DIGITAL_FILTER) || (1 < SCI_IIC_CFG_CH6_DIGITAL_FILTER))
            #error "ERROR - SCI_IIC_CFG_CH6_DIGITAL_FILTER - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH6_FILTER_CLOCK) || (4 < SCI_IIC_CFG_CH6_FILTER_CLOCK))
            #error "ERROR - SCI_IIC_CFG_CH6_FILTER_CLOCK - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH6_SSDA_DELAY_SELECT) || (31 < SCI_IIC_CFG_CH6_SSDA_DELAY_SELECT))
            #error "ERROR - SCI_IIC_CFG_CH6_SSDA_DELAY_SELECT - Parameter error in configures file.  "
        #endif
    #elif (0 == SCI_IIC_CFG_CH6_INCLUDED)
/* do not check */
    #else
        #error "ERROR - SCI_IIC_CFG_CH6_INCLUDED - Parameter error in configures file.  "
    #endif

/* check of channel 7 */
    #if (1 == SCI_IIC_CFG_CH7_INCLUDED)
        #if ((0 >= SCI_IIC_CFG_CH7_BITRATE_BPS) || (384000 < SCI_IIC_CFG_CH7_BITRATE_BPS))
            #error "ERROR - SCI_IIC_CFG_CH7_BITRATE_BPS - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH7_INT_PRIORITY) || ( 15 < SCI_IIC_CFG_CH7_INT_PRIORITY))
            #error "ERROR - SCI_IIC_CFG_CH7_INT_PRIORITY - Parameter error in configures file.  "
        #endif
        #if ((0 > SCI_IIC_CFG_CH7_DIGITAL_FILTER) || (1 < SCI_IIC_CFG_CH7_DIGITAL_FILTER))
            #error "ERROR - SCI_IIC_CFG_CH7_DIGITAL_FILTER - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH7_FILTER_CLOCK) || (4 < SCI_IIC_CFG_CH7_FILTER_CLOCK))
            #error "ERROR - SCI_IIC_CFG_CH7_FILTER_CLOCK - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH7_SSDA_DELAY_SELECT) || (31 < SCI_IIC_CFG_CH7_SSDA_DELAY_SELECT))
            #error "ERROR - SCI_IIC_CFG_CH7_SSDA_DELAY_SELECT - Parameter error in configures file.  "
        #endif
    #elif (0 == SCI_IIC_CFG_CH7_INCLUDED)
/* do not check */
    #else
        #error "ERROR - SCI_IIC_CFG_CH7_INCLUDED - Parameter error in configures file.  "
    #endif

/* check of channel 8 */
    #if (1 == SCI_IIC_CFG_CH8_INCLUDED)
        #if ((0 >= SCI_IIC_CFG_CH8_BITRATE_BPS) || (384000 < SCI_IIC_CFG_CH8_BITRATE_BPS))
            #error "ERROR - SCI_IIC_CFG_CH8_BITRATE_BPS - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH8_INT_PRIORITY) || ( 15 < SCI_IIC_CFG_CH8_INT_PRIORITY))
            #error "ERROR - SCI_IIC_CFG_CH8_INT_PRIORITY - Parameter error in configures file.  "
        #endif
        #if ((0 > SCI_IIC_CFG_CH8_DIGITAL_FILTER) || (1 < SCI_IIC_CFG_CH8_DIGITAL_FILTER))
            #error "ERROR - SCI_IIC_CFG_CH8_DIGITAL_FILTER - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH8_FILTER_CLOCK) || (4 < SCI_IIC_CFG_CH8_FILTER_CLOCK))
            #error "ERROR - SCI_IIC_CFG_CH8_FILTER_CLOCK - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH8_SSDA_DELAY_SELECT) || (31 < SCI_IIC_CFG_CH8_SSDA_DELAY_SELECT))
            #error "ERROR - SCI_IIC_CFG_CH8_SSDA_DELAY_SELECT - Parameter error in configures file.  "
        #endif
    #elif (0 == SCI_IIC_CFG_CH8_INCLUDED)
/* do not check */
    #else
        #error "ERROR - SCI_IIC_CFG_CH8_INCLUDED - Parameter error in configures file.  "
    #endif

/* check of channel 9 */
    #if (1 == SCI_IIC_CFG_CH9_INCLUDED)
        #if ((0 >= SCI_IIC_CFG_CH9_BITRATE_BPS) || (384000 < SCI_IIC_CFG_CH9_BITRATE_BPS))
            #error "ERROR - SCI_IIC_CFG_CH9_BITRATE_BPS - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH9_INT_PRIORITY) || ( 15 < SCI_IIC_CFG_CH9_INT_PRIORITY))
            #error "ERROR - SCI_IIC_CFG_CH9_INT_PRIORITY - Parameter error in configures file.  "
        #endif
        #if ((0 > SCI_IIC_CFG_CH9_DIGITAL_FILTER) || (1 < SCI_IIC_CFG_CH9_DIGITAL_FILTER))
            #error "ERROR - SCI_IIC_CFG_CH9_DIGITAL_FILTER - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH9_FILTER_CLOCK) || (4 < SCI_IIC_CFG_CH9_FILTER_CLOCK))
            #error "ERROR - SCI_IIC_CFG_CH9_FILTER_CLOCK - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH9_SSDA_DELAY_SELECT) || (31 < SCI_IIC_CFG_CH9_SSDA_DELAY_SELECT))
            #error "ERROR - SCI_IIC_CFG_CH9_SSDA_DELAY_SELECT - Parameter error in configures file.  "
        #endif
    #elif (0 == SCI_IIC_CFG_CH9_INCLUDED)
/* do not check */
    #else
        #error "ERROR - SCI_IIC_CFG_CH9_INCLUDED - Parameter error in configures file.  "
    #endif

/* check of channel 10 */
    #if (1 == SCI_IIC_CFG_CH10_INCLUDED)
        #if ((0 >= SCI_IIC_CFG_CH10_BITRATE_BPS) || (384000 < SCI_IIC_CFG_CH10_BITRATE_BPS))
            #error "ERROR - SCI_IIC_CFG_CH10_BITRATE_BPS - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH10_INT_PRIORITY) || ( 15 < SCI_IIC_CFG_CH10_INT_PRIORITY))
            #error "ERROR - SCI_IIC_CFG_CH10_INT_PRIORITY - Parameter error in configures file.  "
        #endif
        #if ((0 > SCI_IIC_CFG_CH10_DIGITAL_FILTER) || (1 < SCI_IIC_CFG_CH10_DIGITAL_FILTER))
            #error "ERROR - SCI_IIC_CFG_CH10_DIGITAL_FILTER - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH10_FILTER_CLOCK) || (4 < SCI_IIC_CFG_CH10_FILTER_CLOCK))
            #error "ERROR - SCI_IIC_CFG_CH10_FILTER_CLOCK - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH10_SSDA_DELAY_SELECT) || (31 < SCI_IIC_CFG_CH10_SSDA_DELAY_SELECT))
            #error "ERROR - SCI_IIC_CFG_CH10_SSDA_DELAY_SELECT - Parameter error in configures file.  "
        #endif
    #elif (0 == SCI_IIC_CFG_CH10_INCLUDED)
/* do not check */
    #else
        #error "ERROR - SCI_IIC_CFG_CH10_INCLUDED - Parameter error in configures file.  "
    #endif

/* check of channel 11 */
    #if (1 == SCI_IIC_CFG_CH11_INCLUDED)
        #if ((0 >= SCI_IIC_CFG_CH11_BITRATE_BPS) || (384000 < SCI_IIC_CFG_CH11_BITRATE_BPS))
            #error "ERROR - SCI_IIC_CFG_CH11_BITRATE_BPS - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH11_INT_PRIORITY) || ( 15 < SCI_IIC_CFG_CH11_INT_PRIORITY))
            #error "ERROR - SCI_IIC_CFG_CH11_INT_PRIORITY - Parameter error in configures file.  "
        #endif
        #if ((0 > SCI_IIC_CFG_CH11_DIGITAL_FILTER) || (1 < SCI_IIC_CFG_CH11_DIGITAL_FILTER))
            #error "ERROR - SCI_IIC_CFG_CH11_DIGITAL_FILTER - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH11_FILTER_CLOCK) || (4 < SCI_IIC_CFG_CH11_FILTER_CLOCK))
            #error "ERROR - SCI_IIC_CFG_CH11_FILTER_CLOCK - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH11_SSDA_DELAY_SELECT) || (31 < SCI_IIC_CFG_CH11_SSDA_DELAY_SELECT))
            #error "ERROR - SCI_IIC_CFG_CH11_SSDA_DELAY_SELECT - Parameter error in configures file.  "
        #endif
    #elif (0 == SCI_IIC_CFG_CH11_INCLUDED)
/* do not check */
    #else
        #error "ERROR - SCI_IIC_CFG_CH11_INCLUDED - Parameter error in configures file.  "
    #endif

/* check of channel 12 */
    #if (1 == SCI_IIC_CFG_CH12_INCLUDED)
        #if ((0 >= SCI_IIC_CFG_CH12_BITRATE_BPS) || (384000 < SCI_IIC_CFG_CH12_BITRATE_BPS))
            #error "ERROR - SCI_IIC_CFG_CH12_BITRATE_BPS - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH12_INT_PRIORITY) || ( 15 < SCI_IIC_CFG_CH12_INT_PRIORITY))
            #error "ERROR - SCI_IIC_CFG_CH12_INT_PRIORITY - Parameter error in configures file.  "
        #endif
        #if ((0 > SCI_IIC_CFG_CH12_DIGITAL_FILTER) || (1 < SCI_IIC_CFG_CH12_DIGITAL_FILTER))
            #error "ERROR - SCI_IIC_CFG_CH12_DIGITAL_FILTER - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH12_FILTER_CLOCK) || (4 < SCI_IIC_CFG_CH12_FILTER_CLOCK))
            #error "ERROR - SCI_IIC_CFG_CH12_FILTER_CLOCK - Parameter error in configures file.  "
        #endif
        #if ((1 > SCI_IIC_CFG_CH12_SSDA_DELAY_SELECT) || (31 < SCI_IIC_CFG_CH12_SSDA_DELAY_SELECT))
            #error "ERROR - SCI_IIC_CFG_CH12_SSDA_DELAY_SELECT - Parameter error in configures file.  "
        #endif
    #elif (0 == SCI_IIC_CFG_CH12_INCLUDED)
/* do not check */
    #else
        #error "ERROR - SCI_IIC_CFG_CH12_INCLUDED - Parameter error in configures file.  "
    #endif

/* Channel select not changed. */
    #if ( (0 == SCI_IIC_CFG_CH0_INCLUDED) && (0 == SCI_IIC_CFG_CH1_INCLUDED) && (0 == SCI_IIC_CFG_CH2_INCLUDED) \
       && (0 == SCI_IIC_CFG_CH3_INCLUDED) && (0 == SCI_IIC_CFG_CH4_INCLUDED) && (0 == SCI_IIC_CFG_CH5_INCLUDED) \
       && (0 == SCI_IIC_CFG_CH6_INCLUDED) && (0 == SCI_IIC_CFG_CH7_INCLUDED) && (0 == SCI_IIC_CFG_CH8_INCLUDED) \
       && (0 == SCI_IIC_CFG_CH9_INCLUDED) && (0 == SCI_IIC_CFG_CH10_INCLUDED) && (0 == SCI_IIC_CFG_CH11_INCLUDED) \
       && (0 == SCI_IIC_CFG_CH12_INCLUDED) )
        #error "ERROR - SCI_IIC_CFG_CHx_INCLUDED (x is 0 to 12) is all 0.- Parameter error in r_sci_iic_rx_config.h."
    #endif

