renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_sci_iic_rx/src/r_sci_iic_rx_private.h
/*----------------------------------------------------------------------------*/
/*   Definitions for ports group.                                             */
/*----------------------------------------------------------------------------*/
    #define PORT0_GR    (0)
    #define PORT1_GR    (1)
    #define PORT2_GR    (2)
    #define PORT3_GR    (3)
    #define PORT4_GR    (4)
    #define PORT5_GR    (5)
    #define PORT6_GR    (6)
    #define PORT7_GR    (7)
    #define PORT8_GR    (8)
    #define PORT9_GR    (9)
    #define PORTA_GR    (0xA)
    #define PORTB_GR    (0xB)
    #define PORTC_GR    (0xC)
    #define PORTD_GR    (0xD)
    #define PORTE_GR    (0xE)
    #define PORTF_GR    (0xF)
    #define PORTG_GR    (0x10)
    #define PORTH_GR    (0x11)
    #define PORTI_GR    (0x11)
    #define PORTJ_GR    (0x12)
    #define PORTK_GR    (0x13)
    #define PORTL_GR    (0x14)
    #define PORTM_GR    (0x15)
    #define PORTN_GR    (0x16)
    #define PORTO_GR    (0x16)
    #define PORTP_GR    (0x16)
    #define PORTQ_GR    (0x17)
    #define PORT_GR_MAX (0x18)

/*----------------------------------------------------------------------------*/
/*  Bit position masks                                                        */
/*----------------------------------------------------------------------------*/
    #define BIT0_MASK   (0x01U)
    #define BIT1_MASK   (0x02U)
    #define BIT2_MASK   (0x04U)
    #define BIT3_MASK   (0x08U)
    #define BIT4_MASK   (0x10U)
    #define BIT5_MASK   (0x20U)
    #define BIT6_MASK   (0x40U)
    #define BIT7_MASK   (0x80U)
    #define BIT8_MASK   (0x0100U)
    #define BIT9_MASK   (0x0200U)
    #define BIT10_MASK  (0x0400U)
    #define BIT11_MASK  (0x0800U)
    #define BIT12_MASK  (0x1000U)
    #define BIT13_MASK  (0x2000U)
    #define BIT14_MASK  (0x4000U)
    #define BIT15_MASK  (0x8000U)
    #define BIT16_MASK  (0x010000U)
    #define BIT17_MASK  (0x020000U)
    #define BIT18_MASK  (0x040000U)
    #define BIT19_MASK  (0x080000U)
    #define BIT20_MASK  (0x100000U)
    #define BIT21_MASK  (0x200000U)
    #define BIT22_MASK  (0x400000U)
    #define BIT23_MASK  (0x800000U)
    #define BIT24_MASK  (0x01000000U)
    #define BIT25_MASK  (0x02000000U)
    #define BIT26_MASK  (0x04000000U)
    #define BIT27_MASK  (0x08000000U)
    #define BIT28_MASK  (0x10000000U)
    #define BIT29_MASK  (0x20000000U)
    #define BIT30_MASK  (0x40000000U)
    #define BIT31_MASK  (0x80000000U)

/*----------------------------------------------------------------------------*/
/*  Define counter.                                                           */
/*----------------------------------------------------------------------------*/
    #define SCI_IIC_STOP_COND_WAIT      ((uint16_t)(1000))  /* Counter of waiting stop condition generation */

/*----------------------------------------------------------------------------*/
/*  Define R/W code for slave address.                                        */
/*----------------------------------------------------------------------------*/
    #define SCI_IIC_W_CODE              ((uint8_t)(0xFE))   /* Write code for slave address */
    #define SCI_IIC_R_CODE              ((uint8_t)(0x01))   /* Read code for slave address */

/*----------------------------------------------------------------------------*/
/*  Define of port control.                                                   */
/*----------------------------------------------------------------------------*/
    #define SCI_IIC_HI                  ((uint8_t)(0x01))   /* Port "H" */
    #define SCI_IIC_LOW                 ((uint8_t)(0x00))   /* Port "L" */
    #define SCI_IIC_OUT                 ((uint8_t)(0x01))   /* Port Output */
    #define SCI_IIC_IN                  ((uint8_t)(0x00))   /* Port Input */
    #define SCI_IIC_BUSY                ((uint8_t)(0x01))   /* Port use as I/O port for peripheral functions. */
    #define SCI_IIC_NOT_BUSY            ((uint8_t)(0x00))   /* Port Use as general I/O port. */

/*----------------------------------------------------------------------------*/
/*  Define bool type.                                                         */
/*----------------------------------------------------------------------------*/
    #define SCI_IIC_FALSE               ((bool)(0x00))      /* False */
    #define SCI_IIC_TRUE                ((bool)(0x01))      /* True */

/*----------------------------------------------------------------------------*/
/*  Define digital filter enable bit.                                         */
/*----------------------------------------------------------------------------*/
    #define SCI_IIC_DF_ENABLE           ((uint8_t)(1))      /* Enable */
    #define SCI_IIC_DF_DISABLE          ((uint8_t)(0))      /* Disable */

/*----------------------------------------------------------------------------*/
/*  Condition bit.                                                            */
/*----------------------------------------------------------------------------*/
    #define SCI_IIC_STAREQ              ((uint8_t)(1))
    #define SCI_IIC_RSTAREQ             ((uint8_t)(2))
    #define SCI_IIC_STPREQ              ((uint8_t)(4))

/*----------------------------------------------------------------------------*/
/*  I2C Interrupt Mode Select (IICINTM bit).                                  */
/*----------------------------------------------------------------------------*/
    #define SCI_IIC_RCV_TRS_INTERRUPT   ((uint8_t)(1))      /* Synchronization with the clock signal */

/*----------------------------------------------------------------------------*/
/*  Clock Synchronization (IICCSC bit).                                       */
/*----------------------------------------------------------------------------*/
    #define SCI_IIC_NO_SYNCHRO          ((uint8_t)(0))      /* No synchronization with the clock signal */
    #define SCI_IIC_SYNCHRO             ((uint8_t)(1))      /* Synchronization with the clock signal */

/*----------------------------------------------------------------------------*/
/*  ACK Transmission Data bit (IICACKT bit).                                  */
/*----------------------------------------------------------------------------*/
    #define SCI_IIC_ACK_TRANS           ((uint8_t)(0))
    #define SCI_IIC_NACK_TRANS          ((uint8_t)(1))

