renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/segger_emwin_demos/src/smc_gen/r_sci_iic_rx/src/r_sci_iic_rx_private.h
/*----------------------------------------------------------------------------*/
/*  ACK Reception Data Flag (IICACKR bit).                                    */
/*----------------------------------------------------------------------------*/
    #define SCI_IIC_ACK_RCV             ((uint8_t)(0))

/*----------------------------------------------------------------------------*/
/*  SSDA/SSCL Output Select (IICSDAS bit/ IICSCLS bit).                       */
/*----------------------------------------------------------------------------*/
    #define SCI_IIC_CLOCK_OUTPUT        ((uint8_t)(0))
    #define SCI_IIC_CON_OUTPUT          ((uint8_t)(1))
    #define SCI_IIC_LOW_OUTPUT          ((uint8_t)(2))
    #define SCI_IIC_HI_Z_OUTPUT         ((uint8_t)(3))

/*----------------------------------------------------------------------------*/
/*  Transimitted/Received Data Transfer Direction bit (SDIR bit).             */
/*----------------------------------------------------------------------------*/
    #define SCI_IIC_LSB_FIRST           ((uint8_t)(0))
    #define SCI_IIC_MSB_FIRST           ((uint8_t)(1))

/*----------------------------------------------------------------------------*/
/*  Define register setting.                                                  */
/*----------------------------------------------------------------------------*/
/* Common registers setting */
    #define SCI_IIC_IICSTIF_CLEAR       ((uint8_t)(0))
    #define SCI_IIC_ST_CON_GENERATED    ((uint8_t)(0x51))
    #define SCI_IIC_RST_CON_GENERATED   ((uint8_t)(0x52))
    #define SCI_IIC_SP_CON_GENERATED    ((uint8_t)(0x54))

    #define SCI_IIC_ONESHOT_WAIT        ((uint8_t)(40))

/* Base register of PCR used to calculate all PCR register addresses. This is constant for all supported MCUs. */
    #define SCI_IIC_PRV_PCR_BASE_REG ((uint8_t volatile *)(&MPC.PWPR.BYTE-95))
/* Base register of PDR used to calculate all PDR register addresses. This is constant for all supported MCUs. */
    #define SCI_IIC_PRV_PDR_BASE_REG ((uint8_t volatile *)(&MPC.PWPR.BYTE-287))
/* Base register of PMR used to calculate all PMR register addresses. This is constant for all supported MCUs. */
    #define SCI_IIC_PRV_PMR_BASE_REG ((uint8_t volatile *)(&MPC.PWPR.BYTE-191))
/* Base register of ODR0 used to calculate all ODR0 register addresses. This is constant for all supported MCUs. */
    #define SCI_IIC_PRV_ODR0_BASE_REG ((uint8_t volatile *)(&MPC.PWPR.BYTE-159))
/* Base register of ODR1 used to calculate all ODR1 register addresses. This is constant for all supported MCUs. */
    #define SCI_IIC_PRV_ODR1_BASE_REG ((uint8_t volatile *)(&MPC.PWPR.BYTE-158))
/* Base register of PFS used to calculate all PFS register addresses. This is constant for all supported MCUs. */
    #define SCI_IIC_PRV_PFS_BASE_REG ((uint8_t volatile *)(&MPC.PWPR.BYTE+33))
/* Base register of PIDR used to calculate all PIDR register addresses. This is constant for all supported MCUs. */
    #define SCI_IIC_PRV_PIDR_BASE_REG ((uint8_t volatile *)(&MPC.PWPR.BYTE-223))

/*----------------------------------------------------------------------------*/
/*  Define int zero.                                                          */
/*----------------------------------------------------------------------------*/
    #define INT_ZERO 0

/***********************************************************************************************************************
 Typedef definitions
 **********************************************************************************************************************/
/*----------------------------------------------------------------------------*/
/*  Define internal sci_iic information structure type.                       */
/*----------------------------------------------------------------------------*/
/* Set number of SCI_IIC channel */
typedef enum
{
    SCI_IIC_NUM_CH0 = 0U,
    SCI_IIC_NUM_CH1,
    SCI_IIC_NUM_CH2,
    SCI_IIC_NUM_CH3,
    SCI_IIC_NUM_CH4,
    SCI_IIC_NUM_CH5,
    SCI_IIC_NUM_CH6,
    SCI_IIC_NUM_CH7,
    SCI_IIC_NUM_CH8,
    SCI_IIC_NUM_CH9,
    SCI_IIC_NUM_CH10,
    SCI_IIC_NUM_CH11,
    SCI_IIC_NUM_CH12,
    SCI_IIC_NUM_CH_MAX
} sci_iic_num_ch_t;

/* Internal Mode. */
typedef enum
{
    SCI_IIC_MODE_NONE = 0U, /* Non-communication mode */
    SCI_IIC_MODE_OPEN, /* Open mode */
    SCI_IIC_MODE_SEND, /* Single master transmission mode */
    SCI_IIC_MODE_RECEIVE, /* Single master reception mode */
    SCI_IIC_MODE_SEND_RECEIVE, /* Single master transmission reception mode */
    SCI_IIC_MODE_GETSTATUS, /* Get status mode */
    SCI_IIC_MODE_CONTROL, /* Control mode */
    SCI_IIC_MODE_CLOSE, /* Close mode */
} sci_iic_api_mode_t;

/* Internal Status. */
typedef enum
{
    SCI_IIC_STS_NO_INIT = 0U, /* None initialization state */
    SCI_IIC_STS_IDLE, /* Idle state */
    SCI_IIC_STS_ST_COND_WAIT, /* Start condition generation completion wait state */
    SCI_IIC_STS_SEND_SLVADR_W_WAIT, /* Slave address [Write] transmission completion wait state */
    SCI_IIC_STS_SEND_SLVADR_R_WAIT, /* Slave address [Read] transmission completion wait state */
    SCI_IIC_STS_SEND_DATA_WAIT, /* Data transmission completion wait state */
    SCI_IIC_STS_RECEIVE_DATA_WAIT, /* Data reception completion wait state */
    SCI_IIC_STS_SP_COND_WAIT, /* Stop condition generation completion wait state */
    SCI_IIC_STS_MAX /* Prohibition of setup above here */
} sci_iic_api_status_t;

/* Internal Event. */
typedef enum
{
    SCI_IIC_EV_INIT = 0U, /* Called function of Initializes IIC driver */
    SCI_IIC_EV_GEN_START_COND, /* Called function of Start condition generation */
    SCI_IIC_EV_INT_START, /* Interrupted start condition generation */
    SCI_IIC_EV_INT_ADD, /* Interrupted address sending */
    SCI_IIC_EV_INT_SEND, /* Interrupted data sending */
    SCI_IIC_EV_INT_STOP, /* Interrupted Stop condition generation */
    SCI_IIC_EV_INT_NACK, /* Interrupted No Acknowledge */
    SCI_IIC_EV_MAX /* Prohibition of setup above here */
} sci_iic_api_event_t;

/*----- Structure type -----*/
/* Internal state transition structure */
typedef struct
{
    sci_iic_api_event_t event_type; /* Event */
    sci_iic_return_t    (*proc) (sci_iic_info_t *); /* handler */
} sci_iic_mtx_t;

/***********************************************************************************************************************
 Exported global variables
 **********************************************************************************************************************/

/***********************************************************************************************************************
 Exported global functions (to be accessed by other files)
 **********************************************************************************************************************/
/*----------------------------------------------------------------------------*/
/*  external function                                                         */
/*----------------------------------------------------------------------------*/
extern sci_iic_return_t r_sci_iic_advance (sci_iic_info_t * p_sci_iic_info);
extern sci_iic_return_t r_sci_iic_check_arguments (sci_iic_info_t * p_sci_iic_info, sci_iic_api_mode_t called_api);

/*----------------------------------------------------------------------------*/
/*  Interrupt Function                                                        */
/*----------------------------------------------------------------------------*/
extern void r_sci_iic_txi_isr_processing (uint8_t ch_no);
extern void r_sci_iic_tei_isr_processing (uint8_t ch_no);

#endif /* SCI_IIC_PRIVATE_H */

